app/Views/includes/public/landing/Landing_body.php

                        <?php
                        // Load User model
                        $userModel = new \App\Models\UserModel();
                        $user = $userModel->find($user_id);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '11'