app/Controllers/HomeController.php

    public function index()
    {
        // Start session
        $session = session();

        // Initialize data array
        $data = [
            'isLoggedIn' => $session->get('isLoggedIn'),
            'user_id' => $session->get('user_id')
        ];

        // Check if the user is logged in and user exists
        if ($data['isLoggedIn']) {
            $userModel = new UserModel();
            $user = $userModel->find($data['user_id']);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'