app/Controllers/LoginController.php

SELECT *
FROM `user_sessions`
WHERE `user_id` = '11'
AND `session_id` = 'irnfmc5t4mr63prd42bpmtknpik50qlt'
AND `is_valid` = 1
---
    public function checkSessionValidity()
    {
        $session = session();

        if ($session->get('isLoggedIn')) {
            $userId = $session->get('user_id');
            $sessionId = $session->get('session_id');

            // Verify session validity from the database
            $db = \Config\Database::connect();
            $sessionData = $db->table('user_sessions')
                ->where('user_id', $userId)
                ->where('session_id', $sessionId)
                ->where('is_valid', 1)
                ->get()
                ->getRow();

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
---
    public function getRedirectAddress()
    {
        // Start session
        $session = session();

        // Check if the user is logged in
        if ($this->checkSessionValidity()) {
            // Load User model
            $userModel = new UserModel();
            $user = $userModel->find($session->get('user_id'));

SELECT *
FROM `user`
WHERE `email` = 'tawsifturabi@gmail.com'
 LIMIT 1
UPDATE `user` SET `lastseen` = 1725541633
WHERE `user`.`id` IN ('1')
---
    public function login()
    {
        helper(['form', 'url']);
        $session = session();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[4]'
        ]);

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        if (empty($email) || empty($password)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Email and password are required.']);
        }

        if (!$validation->withRequest($this->request)->run()) {
            return $this->response->setJSON(['status' => 'error', 'message' => $validation->getErrors()]);
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();

        if ($user && password_verify($password, $user['password'])) {
            $userModel->update($user['id'], ['lastseen' => time()]);

INSERT INTO `user_sessions` (`user_id`, `session_id`, `user_agent`, `ip_address`, `is_valid`, `created_at`, `last_activity`) VALUES ('1', 'rtcl55gc50onpdqrhvk1fvcoh5qlrn2h', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/128.0.0.0 Safari/537.36 Edg/128.0.0.0', '::1', 1, '2024-09-05 13:07:13', '2024-09-05 13:07:13')
---
            $ipAddress = $this->request->getIPAddress();

            $db = \Config\Database::connect();
            $db->table('user_sessions')->insert([
                'user_id' => $user['id'],
                'session_id' => $sessionId,
                'user_agent' => $userAgent,
                'ip_address' => $ipAddress,
                'is_valid' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'last_activity' => date('Y-m-d H:i:s')
            ]);

UPDATE `user_sessions` SET `is_valid` = 0
WHERE `session_id` = 'sn9fd9oof3vij30u99irblk94amu3vej'
---
    public function logout()
    {
        $session = session();
        $sessionId = $session->get('session_id');

        if ($sessionId) {
            $db = \Config\Database::connect();
            $db->table('user_sessions')->where('session_id', $sessionId)->update(['is_valid' => 0]);

SELECT *
FROM `user`
WHERE `email` = 'robin@roundrobin.hood'
 LIMIT 1
---

        $userModel = new UserModel();

        if ($userModel->where('email', $email)->first()) {

INSERT INTO `user` (`email`, `name`, `phone`, `dob`, `gender`, `blood_group`, `password`, `usertype`) VALUES ('robin@roundrobin.hood', 'Robin Hood', '1234567890', '2024-09-11', 'Male', 'A+', '$2y$10$OSYPyYTfTnCk3P/cfJx7jO..3bFDipCKyUIu/cWRie0lRtPt8dUem', 'general')
---

        $hashedPassword = password_hash($password, PASSWORD_BCRYPT);

        $userId = $userModel->insert([
            'email' => $email,
            'name' => $name,
            'phone' => $phone,
            'dob' => $dob,
            'gender' => $gender,
            'blood_group' => $bloodGroup,
            'password' => $hashedPassword,
            'usertype' => 'general'
        ]);