app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
---
        public function UploadProfilePhoto()
        {
            // Start session
            $session = session();

            // Check if the user is logged in
            if ($session->get('isLoggedIn')) {
                // Load User model
                $userModel = new UserModel();
                $user = $userModel->find($session->get('user_id'));