app/Models/HeatzoneLocationModel.php

SELECT *
FROM `heatzone_locations`
---
    public function getAllLocations()
    {
        return $this->findAll();